public class HW_2 {

    public static void main(String[] args) {

        //Задача №1
        //
        //Необходимо создать целочисленные переменные a и b,
        // присвоить произвольные значения переменным на ваш выбор
        // и вывести результаты следующих операций с этими переменными:
        //сложение;
        //умножение;
        //вычитание;
        //деление;
        //остаток от деления.
        //Так же сделать проверку на четность этих переменных и вывести результат.

        int a = 3;
        int b = 6;

        System.out.println(a+b);
        System.out.println(a*b);
        System.out.println(b-a);
        System.out.println(b/a);

        System.out.println(b%a);

        System.out.println(b%2);
        System.out.println(a%2);

    }

}
